const months = [
  {
    name: 'farvardin',
    monthJalali: 'فروردین ۱۴۰۰',
    monthHijri: 'شعبان - رمضان ۱۴۴۲',
    monthGregorian: 'March - April 2021',
    jalali: [30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
      1, 2, 3],
    gregorian: [20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23],
    hijri: [6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    holidays: [1, 2, 3, 4, 9, 12, 13],
    occasions: '',
  },
  {
    name: 'ordibehesht',
    monthJalali: 'اردیبهشت ۱۴۰۰',
    monthHijri: 'رمضان - شوال ۱۴۴۲',
    monthGregorian: 'April - May 2021',
    jalali: [28, 29, 30, 31,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      31],
    gregorian: [17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21],
    hijri: [4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29,
      1, 2, 3, 4, 5, 6, 7, 8, 9],
    holidays: [14, 23],
    occasions: '',
  },
  {
    name: 'khordad',
    monthJalali: 'خرداد ۱۴۰۰',
    monthHijri: 'شوال - ذوالقعده ۱۴۴۲',
    monthGregorian: 'May - June 2021',
    jalali: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
      1, 2, 3, 4],
    gregorian: [22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25],
    hijri: [10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14],
    holidays: [15, 16],
    occasions: '',
  },
  {
    name: 'tir',
    monthJalali: 'تیر ۱۴۰۰',
    monthHijri: 'ذوالقعده - ذوالحجه ۱۴۴۲',
    monthGregorian: 'June - July 2021',
    jalali: [29, 30, 31,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      31, 1],
    gregorian: [19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23],
    hijri: [8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12],
    holidays: [30],
    occasions: '',
  },
  {
    name: 'mordad',
    monthJalali: 'مرداد ۱۴۰۰',
    monthHijri: 'ذوالحجه - محرم ۱۴۴۲',
    monthGregorian: 'July - August 2021',
    jalali: [26, 27, 28, 29, 30, 31,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
      1, 2, 3, 4, 5],
    gregorian: [17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27],
    hijri: [6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18],
    holidays: [7, 27, 28],
    occasions: '',
  },
  {
    name: 'shahrivar',
    monthJalali: 'شهریور ۱۴۰۰',
    monthHijri: 'محرم - صفر ۱۴۴۳',
    monthGregorian: 'August - September 2021',
    jalali: [30, 31,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
      1, 2],
    gregorian: [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24],
    hijri: [12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17],
    holidays: [],
    occasions: '',
  },
  {
    name: 'mehr',
    monthJalali: 'مهر ۱۴۰۰',
    monthHijri: 'صفر - ربیع‌الأول ۱۴۴۳',
    monthGregorian: 'September - October 2021',
    jalali: [27, 28, 29, 30, 31,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
    gregorian: [18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22],
    hijri: [11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15],
    holidays: [5, 13, 15],
    occasions: `
            ۱ مهر ــ آغاز حمله مغول به ایران در پاییز ۵۹۳ خورشیدی<br/>
            ۵ مهر ــ روز جهانی جهانگردی [ 27 September ]<br/>
            <span style="color: red">۵ مهر ــ اربعین حسینی [ ٢٠ صفر ]</span><br/>
            ۷ مهر ــ روز آتش نشانی و ایمنی<br/>
            ۷ مهر ــ سقوط هواپیمای حامل جمعی از فرماندهان جنگ (کلاهدوز، نامجو، فلاحی، فکوری، جهان آرا) در سال ۱۳۶۰<br/>
            ۸ مهر ــ روزبزرگداشت مولوی<br/>
            ۸ مهر ــ روز جهانی ناشنوایان [ 30 September ]<br/>
            ۸ مهر ــ روز جهانی ترجمه و مترجم [ 30 September ]<br/>
            ۹ مهر ــ روز جهانی سالمندان [ 1 October ]<br/>
            ۱۰ مهر ــ روز جشن مهرگان<br/>
            ۱۳ مهر ــ روز نیروی انتظامی<br/>
            <span style="color: red">۱۳ مهر ــ رحلت رسول اکرم؛ شهادت امام حسن مجتبی علیه السلام [ ٢٨ صفر ]</span><br/>
            ۱۳ مهر ــ روز جهانی معلم [ 5 October ]<br/>
            ۱۴ مهر ــ روز دامپزشکی<br/>
            <span style="color: red">۱۵ مهر ــ شهادت امام رضا علیه السلام [ ٣٠ صفر ]</span><br/>
            ۱۶ مهر ــ روز ملی کودک<br/>
            ۱۶ مهر ــ هجرت پیامبر اکرم از مکه به مدینه [ ١ ربيع الاول ]<br/>
            ۱۷ مهر ــ روز جهانی پست [ 9 October ]<br/>
            ۱۸ مهر ــ روز جهانی مبارزه با حکم اعدام [ 10 October ]<br/>
            ۱۹ مهر ــ روز جهانی دختر [ 11 October ]<br/>
            ۲۰ مهر ــ روز بزرگداشت حافظ<br/>
            ۲۱ مهر ــ جشن پیروزی کاوه و فریدون<br/>
            ۲۲ مهر ــ روز جهانی استاندارد [ 14 October ]<br/>
            ۲۳ مهر ــ روز جهانی عصای سفید [ 15 October ]<br/>
            ۲۳ مهر ــ شهادت امام حسن عسکری علیه السلام [ ٨ ربيع الاول ]<br/>
            ۲۴ مهر ــ روز جهانی غذا [ 16 October ]<br/>
            ۲۵ مهر ــ روز جهانی ریشه کنی فقر [ 17 October ]<br/>
            ۲۶ مهر ــ روز تربیت بدنی و ورزش<br/>
            ۲۷ مهر ــ میلاد رسول اکرم به روایت اهل سنت [ ١٢ ربيع الاول ]<br/>
            ۲۹ مهر ــ روز ملی کوهنورد<br/>
         `,
  },
  {
    name: 'aban',
    monthJalali: 'آبان ۱۴۰۰',
    monthHijri: 'ربیع‌الأول - ربیع‌الثّانی ۱۴۴۳',
    monthGregorian: 'October - November 2021',
    jalali: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5],
    gregorian: [23, 24, 25, 26, 27, 28, 29, 30, 31,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26],
    hijri: [16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
    holidays: [2],
    occasions: `
            ۱ آبان ـ روز آمار و برنامه ریزی<br/>
            <span style="color: red">۲ آبان ــ میلاد رسول اکرم و امام جعفر صادق علیه السلام [ ١٧ ربيع الاول ]</span><br/>
            ۷ آبان ــ سالروز ورود کوروش بزرگ به بابل در سال ۵۳۹ پیش از میلاد<br/>
            ۸ آبان ــ روز نوجوان<br/>
            ۱۰ آبان ــ آبان روز، جشن آبانگان<br/>
            ۱۳ آبان ــ روز دانش آموز<br/>
            ۱۴ آبان ــ روز فرهنگ عمومی<br/>
            ۱۵ آبان ــ جشن میانه پاییز<br/>
            ۱۸ آبان ــ روز ملی کیفیت<br/>
            ۲۳ آبان ــ ولادت امام حسن عسکری علیه السلام [ ٨ ربيع الثاني ]<br/>
            ۲۳ آبان ــ روز جهانی دیابت [ 14 November ]<br/>
            ۲۴ آبان ــ روز کتاب و کتابخوانی<br/>
            ۲۵ آبان ــ وفات حضرت معصومه سلام الله علیها [ ١٠ ربيع الثاني ]<br/>
            ۲۷ آبان ــ روز جهانی فلسفه [ 18 November ]<br/>
            ۲۸ آبان ــ روز جهانی آقایان [ 19 November ]<br/>
            ۲۹ آبان ــ روز جهانی کودک [ 20 November ]<br/>
      `,
  },
  {
    name: 'azar',
    monthJalali: 'آذر ۱۴۰۰',
    monthHijri: 'ربیع‌الثّانی - جمادی‌الأولی ۱۴۴۳',
    monthGregorian: 'November - December 2021',
    jalali: [29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3],
    gregorian: [20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24],
    hijri: [14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19],
    holidays: [],
    occasions: `
         ۱ آذر ــ آذر جشن<br/>
         ۴ آذر ــ روز جهانی مبارزه با خشونت علیه زنان [ 25 November ]<br/>
         ۵ آذر ــ روز بسیج مستضعفان<br/>
         ۷ آذر ــ روز نیروی دریایی<br/>
         ۹ آذر ــ جشن آذرگان، آذر روز<br/>
         ۱۰ آذر ــ روز مجلس<br/>
         ۱۰ آذر ــ روز جهانی ایدز [ 1 December ]<br/>
         ۱۲ آذر ــ روز جهانی معلولان [ 3 December ]<br/>
         ۱۳ آذر ــ روز بیمه<br/>
         ۱۵ آذر ــ روز حسابدار<br/>
         ۱۶ آذر ــ روز دانشجو<br/>
         ۱۹ آذر ــ ولادت حضرت زینب سلام الله علیها و روز پرستار و بهورز [ ٥ جمادي الاولي ]<br/>
         ۲۰ آذر ــ روز جهانی کوه نوردی [ 11 December ]<br/>
         ۲۵ آذر ــ روز پژوهش<br/>
         ۲۶ آذر ــ روز حمل و نقل<br/>
         ۳۰ آذر ــ جشن شب یلدا<br/>
      `,
  },
  {
    name: 'dey',
    monthJalali: 'دی ۱۴۰۰',
    monthHijri: 'جمادی‌الأولی - جمادی‌الثّانی ۱۴۴۳',
    monthGregorian: 'December 2021 - January 2022',
    jalali: [27, 28, 29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1],
    gregorian: [18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21],
    hijri: [13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18],
    holidays: [16],
    occasions: `
         ۱ دی ــ روز میلاد خورشید؛ جشن خرم روز، نخستین جشن دیگان<br/>
         ۴ دی ــ جشن کریسمس [ 25 December ]<br/>
         ۵ دی ــ زمین لرزه ی بم [۱۳۸۲ خورشیدی]<br/>
         ۵ دی ــ سالروز شهادت آشو زرتشت، اَبَر انسان بزرگ تاریخ<br/>
         ۸ دی ــ دی به آذر روز، دومین جشن دیگان<br/>
         ۱۱ دی ــ جشن آغاز سال نو میلادی [ 1 January ]<br/>
         ۱۳ دی ــ شهادت سردار حاج قاسم سلیمانی [۱۳۹۸ خورشیدی]<br/>
         ۱۵ دی ــ دی به مهر روز، سومین جشن دیگان<br/>
         <span style="color: red">۱۶ دی ــ شهادت حضرت فاطمه زهرا سلام الله علیها [ ٣ جمادي الثاني ]</span><br/>
         ۱۶ دی ــ غرق شدن کشتی سانچی [1396 خورشیدی]<br/>
         ۱۸ دی ــ شلیک به پرواز 752 هواپیمایی اوکراین [1398 خورشیدی]<br/>
         ۱۹ دی ــ درگذشت اکبر هاشمی رفسنجانی [1395 خورشیدی]<br/>
         ۲۰ دی ــ قتل امیرکبیر به دستور ناصرالدین شاه قاجار [1230 خورشیدی]<br/>
         ۲۳ دی ــ دی به دین روز، چهارمین جشن دیگان<br/>
         ۳۰ دی ــ آتش‌سوزی و فروریختن ساختمان پلاسکو [1395 خورشیدی]<br/>
      `,
  },
  {
    name: 'bahman',
    monthJalali: 'بهمن ۱۴۰۰',
    monthHijri: 'جمادی‌الثّانی - رجب ۱۴۴۳',
    monthGregorian: 'January - February 2022',
    jalali: [25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5, 6],
    gregorian: [15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25],
    hijri: [12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23],
    holidays: [26],
    occasions: `
      ۱ بهمن زادروز فردوسی<br/>
      ۲ بهمن بهمن روز، جشن بهمنگان<br/>
      ۳ بهمن ولادت حضرت فاطمه زهرا سلام الله علیها و روز مادر [ ٢٠ جمادي الثانيه ]<br/>
      ۵ بهمن جشن نوسره<br/>
      ۱۰ بهمن جشن سده<br/>
      ۱۲ بهمن بازگشت امام خمینی (ره) به ایران<br/>
      ۱۴ بهمن ولادت امام محمد باقر علیه السلام [ ١ رجب ]<br/>
      ۱۵ بهمن جشن میانه زمستان<br/>
      ۱۶ بهمن شهادت امام علی النقی الهادی علیه السلام [ ٣ رجب ]<br/>
      ۱۹ بهمن روز نیروی هوایی<br/>
      <span style="color: red">۲۲ بهمن پیروزی انقلاب اسلامی</span><br/>
      ۲۲ بهمن حمله به سفارت روسیه و قتل گریبایدوف سفیر روسیه تزاری در ایران [ 11 February ]<br/>
      ۲۳ بهمن ولادت امام محمد تقی علیه السلام [ ١٠ رجب ]<br/>
      ۲۳ بهمن زادروز چارلز داروین بنیانگذار نظریه‌ی فرگشت از طریق انتخاب طبیعی [ 12 February ]<br/>
      ۲۵ بهمن جشن ولنتاین [ 14 February ]<br/>
      <span style="color: red">۲۶ بهمن ولادت امام علی علیه السلام و روز پدر [ ١٣ رجب ]</span><br/>
      ۲۸ بهمن وفات حضرت زینب سلام الله علیها [ ١٥ رجب ]<br/>
      ۲۹ بهمن جشن سپندارمذگان و روز عشق<br/>
      ۲۹ بهمن فاجعه انفجار قطار نیشابور [1382 خورشیدی]
    `,
  },
  {
    name: 'esfand',
    monthJalali: 'اسفند ۱۴۰۰',
    monthHijri: 'رجب - شعبان ۱۴۴۳',
    monthGregorian: 'February - March 2022',
    jalali: [30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
      1, 2, 3, 4, 5],
    gregorian: [19, 20,
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22, 23, 24, 25],
    hijri: [17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
      1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
      11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
      21, 22],
    holidays: [10, 29],
    occasions: '',
  },
];

export default months;
